public class Main {
    public static void main(String[] args) {
//Задание 1
       // int age = 20;
     //   if (age >= 18) {
        //    System.out.println("Поздравляем Вас с совершеннолетием!");
     //   } else {
      //      System.out.println("Возраст совершеннолетия ещё не наступил, нужно немного подождать");

            // Задание 2
     //   int age = 32;
     //   if (age >= 7 && age < 18) {
      //          System.out.println("Ребёнок ходит в Школу"); }
      //  if (age >= 18 && age < 24) {
      //          System.out.println("Человек окончил школу и может отправляться в университет"); }
      //  if (age >= 24) {
      //      System.out.println("Человек окончил университет и пора искать первую работу"); }


        }

    }





